In [33]:
import pandas as pd

In [34]:
df = pd.read_csv("pizza_sales.csv")
df.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1.0,1.0,hawaiian_m,1.0,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2.0,2.0,classic_dlx_m,1.0,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3.0,2.0,five_cheese_l,1.0,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4.0,2.0,ital_supr_l,1.0,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5.0,2.0,mexicana_m,1.0,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza

In [35]:
df.columns

Index(['pizza_id', 'order_id', 'pizza_name_id', 'quantity', 'order_date',
       'order_time', 'unit_price', 'total_price', 'pizza_size',
       'pizza_category', 'pizza_ingredients', 'pizza_name'],
      dtype='object')

In [36]:
df.dtypes

pizza_id             float64
order_id             float64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
dtype: object

# Date Dimension

In [37]:
df['order_date']=df['order_date'].astype(str)
df['order_time']=df['order_time'].astype(str)

In [41]:
df['order_date']

0          1/1/2015
1          1/1/2015
2          1/1/2015
3          1/1/2015
4          1/1/2015
            ...
48615    31-12-2015
48616    31-12-2015
48617    31-12-2015
48618    31-12-2015
48619    31-12-2015
Name: order_date, Length: 48620, dtype: object

In [39]:
date_dim = df[['order_date', 'order_time']].drop_duplicates().copy()

In [40]:
date_dim

       order_date order_time
0        1/1/2015   11:38:36
1        1/1/2015   11:57:40
6        1/1/2015   12:12:28
8        1/1/2015   12:16:31
9        1/1/2015   12:21:30
...           ...        ...
48607  31-12-2015   20:51:07
48611  31-12-2015   21:14:37
48615  31-12-2015   21:23:10
48618  31-12-2015   22:09:54
48619  31-12-2015   23:02:05

[21350 rows x 2 columns]

In [42]:
date_dim['order_date'] = date_dim['order_date'].str.replace('-', '/', regex=False)

In [43]:
date_dim

       order_date order_time
0        1/1/2015   11:38:36
1        1/1/2015   11:57:40
6        1/1/2015   12:12:28
8        1/1/2015   12:16:31
9        1/1/2015   12:21:30
...           ...        ...
48607  31/12/2015   20:51:07
48611  31/12/2015   21:14:37
48615  31/12/2015   21:23:10
48618  31/12/2015   22:09:54
48619  31/12/2015   23:02:05

[21350 rows x 2 columns]

In [44]:
date_dim['date_obj'] = pd.to_datetime(date_dim['order_date'], dayfirst=True, errors='coerce')

In [45]:
date_dim['date_obj']

0       2015-01-01
1       2015-01-01
6       2015-01-01
8       2015-01-01
9       2015-01-01
           ...
48607   2015-12-31
48611   2015-12-31
48615   2015-12-31
48618   2015-12-31
48619   2015-12-31
Name: date_obj, Length: 21350, dtype: datetime64[ns]

In [46]:
date_dim['date_obj'].isna().sum()

0

In [47]:
date_dim

       order_date order_time   date_obj
0        1/1/2015   11:38:36 2015-01-01
1        1/1/2015   11:57:40 2015-01-01
6        1/1/2015   12:12:28 2015-01-01
8        1/1/2015   12:16:31 2015-01-01
9        1/1/2015   12:21:30 2015-01-01
...           ...        ...        ...
48607  31/12/2015   20:51:07 2015-12-31
48611  31/12/2015   21:14:37 2015-12-31
48615  31/12/2015   21:23:10 2015-12-31
48618  31/12/2015   22:09:54 2015-12-31
48619  31/12/2015   23:02:05 2015-12-31

[21350 rows x 3 columns]

In [48]:
date_dim['day'] = date_dim['date_obj'].dt.day
date_dim['month'] = date_dim['date_obj'].dt.month
date_dim['year'] = date_dim['date_obj'].dt.year

In [49]:
date_dim.head()

  order_date order_time   date_obj  day  month  year
0   1/1/2015   11:38:36 2015-01-01    1      1  2015
1   1/1/2015   11:57:40 2015-01-01    1      1  2015
6   1/1/2015   12:12:28 2015-01-01    1      1  2015
8   1/1/2015   12:16:31 2015-01-01    1      1  2015
9   1/1/2015   12:21:30 2015-01-01    1      1  2015

In [50]:
date_dim.drop(columns=['date_obj'], inplace=True)

In [51]:
date_dim.head()

  order_date order_time  day  month  year
0   1/1/2015   11:38:36    1      1  2015
1   1/1/2015   11:57:40    1      1  2015
6   1/1/2015   12:12:28    1      1  2015
8   1/1/2015   12:16:31    1      1  2015
9   1/1/2015   12:21:30    1      1  2015

In [52]:
date_dim = date_dim.reset_index(drop=True)
date_dim['date_id'] = date_dim.index + 1

In [53]:
date_dim['date_id'].is_unique

True

In [54]:
date_dim = date_dim[['date_id', 'order_date', 'order_time', 'day', 'month', 'year']]

In [55]:
date_dim

       date_id  order_date order_time  day  month  year
0            1    1/1/2015   11:38:36    1      1  2015
1            2    1/1/2015   11:57:40    1      1  2015
2            3    1/1/2015   12:12:28    1      1  2015
3            4    1/1/2015   12:16:31    1      1  2015
4            5    1/1/2015   12:21:30    1      1  2015
...        ...         ...        ...  ...    ...   ...
21345    21346  31/12/2015   20:51:07   31     12  2015
21346    21347  31/12/2015   21:14:37   31     12  2015
21347    21348  31/12/2015   21:23:10   31     12  2015
21348    21349  31/12/2015   22:09:54   31     12  2015
21349    21350  31/12/2015   23:02:05   31     12  2015

[21350 rows x 6 columns]

In [56]:
df = df.merge(
    date_dim[['order_date', 'order_time', 'date_id']],
    on=['order_date', 'order_time'],
    how='left'
)

In [57]:
df.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,date_id
0,1.0,1.0,hawaiian_m,1.0,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,1.0
1,2.0,2.0,classic_dlx_m,1.0,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,2.0
2,3.0,2.0,five_cheese_l,1.0,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,2.0
3,4.0,2.0,ital_supr_l,1.0,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,2.0
4,5.0,2.0,mexicana_m,1.0,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,2.0

In [58]:
df.dtypes

pizza_id             float64
order_id             float64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
date_id              float64
dtype: object

In [59]:
date_dim.dtypes

date_id        int64
order_date    object
order_time    object
day            int32
month          int32
year           int32
dtype: object

In [60]:
df['date_id']=df['date_id'].astype('Int64')
df.dtypes

pizza_id             float64
order_id             float64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
date_id                Int64
dtype: object

# pizza category Dimension

In [61]:
pizza_category_dim = df[[
    'pizza_name_id',
    'pizza_category',
    'pizza_ingredients'
]].drop_duplicates().reset_index(drop=True)

In [62]:
pizza_category_dim

,pizza_name_id,pizza_category,pizza_ingredients
0,hawaiian_m,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
1,classic_dlx_m,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,..."
2,five_cheese_l,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go..."
3,ital_supr_l,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni..."
4,mexicana_m,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O..."
...,...,...,...
86,the_greek_l,Classic,"Kalamata Olives, Feta Cheese, Tomatoes, Garlic..."
87,soppressata_m,Supreme,"Soppressata Salami, Fontina Cheese, Mozzarella..."
88,soppressata_s,Supreme,"Soppressata Salami, Fontina Cheese, Mozzarella..."
89,calabrese_l,Supreme,"?duja Salami, Pancetta, Tomatoes, Red Onions, ..."
90,the_greek_xxl,Classic,"Kalamata Olives, Feta Cheese, Tomatoes, Garlic..."

In [66]:
pizza_category_dim['pizza_name_id'].is_unique

True

In [63]:
pizza_category_dim.dtypes

pizza_name_id        object
pizza_category       object
pizza_ingredients    object
dtype: object

In [69]:
df.dtypes

pizza_id             float64
order_id             float64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
date_id                Int64
dtype: object

# pizza Dimension

In [70]:
pizza_dim = df[[
    'pizza_id',
    'pizza_name_id',
    'pizza_name',
    'pizza_size',
    'unit_price'
]].drop_duplicates().reset_index(drop=True)

In [71]:
pizza_dim

,pizza_id,pizza_name_id,pizza_name,pizza_size,unit_price
0,1.0,hawaiian_m,The Hawaiian Pizza,M,13.25
1,2.0,classic_dlx_m,The Classic Deluxe Pizza,M,16.00
2,3.0,five_cheese_l,The Five Cheese Pizza,L,18.50
3,4.0,ital_supr_l,The Italian Supreme Pizza,L,20.75
4,5.0,mexicana_m,The Mexicana Pizza,M,16.00
...,...,...,...,...,...
48615,48616.0,ckn_alfredo_m,The Chicken Alfredo Pizza,M,16.75
48616,48617.0,four_cheese_l,The Four Cheese Pizza,L,17.95
48617,48618.0,napolitana_s,The Napolitana Pizza,S,12.00
48618,48619.0,mexicana_l,The Mexicana Pizza,L,20.25
48619,48620.0,bbq_ckn_s,The Barbecue Chicken Pizza,S,12.75

In [72]:
pizza_dim.dtypes

pizza_id         float64
pizza_name_id     object
pizza_name        object
pizza_size        object
unit_price       float64
dtype: object

In [73]:
pizza_dim['pizza_id']=pizza_dim['pizza_id'].astype('Int64')
df['pizza_id']=df['pizza_id'].astype('Int64')

In [74]:
pizza_dim.dtypes

pizza_id           Int64
pizza_name_id     object
pizza_name        object
pizza_size        object
unit_price       float64
dtype: object

In [75]:
df.dtypes

pizza_id               Int64
order_id             float64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
date_id                Int64
dtype: object

In [76]:
pizza_dim['pizza_id'].is_unique

True

# order fact

In [77]:
df['order_id'].is_unique

False

In [78]:
df[['order_id', 'pizza_id']].duplicated().any()

False

In [79]:
order_fact = df[['order_id', 'pizza_id', 'quantity', 'total_price', 'date_id']].copy()

In [80]:
order_fact

       order_id  pizza_id  quantity  total_price  date_id
0           1.0         1       1.0        13.25        1
1           2.0         2       1.0        16.00        2
2           2.0         3       1.0        18.50        2
3           2.0         4       1.0        20.75        2
4           2.0         5       1.0        16.00        2
...         ...       ...       ...          ...      ...
48615   21348.0     48616       1.0        16.75     <NA>
48616   21348.0     48617       1.0        17.95     <NA>
48617   21348.0     48618       1.0        12.00     <NA>
48618   21349.0     48619       1.0        20.25     <NA>
48619   21350.0     48620       1.0        12.75     <NA>

[48620 rows x 5 columns]

In [81]:
order_fact = order_fact.reset_index(drop=True)
order_fact['order_fact_SK'] = order_fact.index + 1

In [82]:
order_fact['order_fact_SK'].is_unique

True

In [83]:
order_fact

       order_id  pizza_id  quantity  total_price  date_id  order_fact_SK
0           1.0         1       1.0        13.25        1              1
1           2.0         2       1.0        16.00        2              2
2           2.0         3       1.0        18.50        2              3
3           2.0         4       1.0        20.75        2              4
4           2.0         5       1.0        16.00        2              5
...         ...       ...       ...          ...      ...            ...
48615   21348.0     48616       1.0        16.75     <NA>          48616
48616   21348.0     48617       1.0        17.95     <NA>          48617
48617   21348.0     48618       1.0        12.00     <NA>          48618
48618   21349.0     48619       1.0        20.25     <NA>          48619
48619   21350.0     48620       1.0        12.75     <NA>          48620

[48620 rows x 6 columns]

In [84]:
order_fact.dtypes

order_id         float64
pizza_id           Int64
quantity         float64
total_price      float64
date_id            Int64
order_fact_SK      int64
dtype: object

In [85]:
df.dtypes

pizza_id               Int64
order_id             float64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
date_id                Int64
dtype: object

In [86]:
order_fact['order_id']=order_fact['order_id'].astype('Int64')
df['order_id']=df['order_id'].astype('Int64')

In [87]:
order_fact.dtypes

order_id           Int64
pizza_id           Int64
quantity         float64
total_price      float64
date_id            Int64
order_fact_SK      int64
dtype: object

In [88]:
df.dtypes

pizza_id               Int64
order_id               Int64
pizza_name_id         object
quantity             float64
order_date            object
order_time            object
unit_price           float64
total_price          float64
pizza_size            object
pizza_category        object
pizza_ingredients     object
pizza_name            object
date_id                Int64
dtype: object

In [89]:
order_fact

       order_id  pizza_id  quantity  total_price  date_id  order_fact_SK
0             1         1       1.0        13.25        1              1
1             2         2       1.0        16.00        2              2
2             2         3       1.0        18.50        2              3
3             2         4       1.0        20.75        2              4
4             2         5       1.0        16.00        2              5
...         ...       ...       ...          ...      ...            ...
48615     21348     48616       1.0        16.75     <NA>          48616
48616     21348     48617       1.0        17.95     <NA>          48617
48617     21348     48618       1.0        12.00     <NA>          48618
48618     21349     48619       1.0        20.25     <NA>          48619
48619     21350     48620       1.0        12.75     <NA>          48620

[48620 rows x 6 columns]

# loading data into snowflake

In [90]:
pip install snowflake-connector-python

Requirement already satisfied: snowflake-connector-python in c:\users\yahia zakaria\anaconda3\lib\site-packages (3.15.0)
Requirement already satisfied: asn1crypto<2.0.0,>0.24.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (1.5.1)
Requirement already satisfied: boto3>=1.24 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (1.38.23)
Requirement already satisfied: botocore>=1.24 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (1.38.23)
Requirement already satisfied: cffi<2.0.0,>=1.9 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (1.17.1)
Requirement already satisfied: cryptography>=3.1.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (43.0.0)
Requirement already satisfied: pyOpenSSL<26.0.0,>=22.0.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (24.2.1)
Requirement already satisfied: pyjwt<3.0.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (2.8.0)
Requirement already satisfied: pytz in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (2024.1)
Requirement already satisfied: requests<3.0.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (2.32.3)
Requirement already satisfied: packaging in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (24.1)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (3.7)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (2025.1.31)
Requirement already satisfied: typing_extensions<5,>=4.3 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (4.11.0)
Requirement already satisfied: filelock<4,>=3.5 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (3.13.1)
Requirement already satisfied: sortedcontainers>=2.4.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (2.4.0)
Requirement already satisfied: platformdirs<5.0.0,>=2.6.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (3.10.0)
Requirement already satisfied: tomlkit in c:\users\yahia zakaria\anaconda3\lib\site-packages (from snowflake-connector-python) (0.11.1)
Requirement already satisfied: jmespath<2.0.0,>=0.7.1 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from boto3>=1.24->snowflake-connector-python) (1.0.1)
Requirement already satisfied: s3transfer<0.14.0,>=0.13.0 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from boto3>=1.24->snowflake-connector-python) (0.13.0)
Requirement already satisfied: python-dateutil<3.0.0,>=2.1 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from botocore>=1.24->snowflake-connector-python) (2.9.0.post0)
Requirement already satisfied: urllib3!=2.2.0,<3,>=1.25.4 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from botocore>=1.24->snowflake-connector-python) (2.2.3)
Requirement already satisfied: pycparser in c:\users\yahia zakaria\anaconda3\lib\site-packages (from cffi<2.0.0,>=1.9->snowflake-connector-python) (2.21)
Requirement already satisfied: six>=1.5 in c:\users\yahia zakaria\anaconda3\lib\site-packages (from python-dateutil<3.0.0,>=2.1->botocore>=1.24->snowflake-connector-python) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [91]:
import snowflake.connector
from snowflake.connector.pandas_tools import write_pandas

In [92]:
conn = snowflake.connector.connect(
    user='******',
    password='*****',
    account='****',   
    warehouse='COMPUTE_WH',
    database='pizza_dw',
    schema='analytics'
)

In [93]:
def upload_df_to_snowflake(df, table_name):
    success, nchunks, nrows, _ = write_pandas(conn, df, table_name.upper())
    if success:
        print(f"Uploaded {nrows} rows to {table_name} successfully.")
    else:
        print(f"Failed to upload {table_name}.")

In [94]:
date_dim.columns = [col.upper() for col in date_dim.columns]
pizza_dim.columns = [col.upper() for col in pizza_dim.columns]
pizza_category_dim.columns = [col.upper() for col in pizza_category_dim.columns]
order_fact.columns = [col.upper() for col in order_fact.columns]

In [95]:
upload_df_to_snowflake(date_dim, 'date_dim')
upload_df_to_snowflake(pizza_dim, 'pizza_dim')
upload_df_to_snowflake(order_fact, 'order_fact')
upload_df_to_snowflake(pizza_category_dim, 'pizza_category_dim')

Uploaded 21350 rows to date_dim successfully.
Uploaded 48620 rows to pizza_dim successfully.
Uploaded 48620 rows to order_fact successfully.
Uploaded 91 rows to pizza_category_dim successfully.

In [96]:
conn.close()